Котельников_АБ_70153995/src/Documents/СогласованиеЗаявки/СогласованиеЗаявки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СогласованиеЗаявки</name>
  <basedOn>Document.ЗаявкаНаПодбор</basedOn>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПодбор</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласована</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отклонена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтклонения</name>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаявок</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеПричины</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнициаторЗаявки</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЗаявку</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

Котельников_АБ_70153995/src/Enums/СтатусыЗаявокНаПодбор/СтатусыЗаявокНаПодбор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокНаПодбор</name>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>Согласование</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/Documents/СогласованиеЗаявки/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПроверитьСтатусЗаявки(Объект.Заявка.СтатусЗаявки, Отказ)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ОтобразитьПричинуОтклонения();
	ОтобразитьСтатусСогласованияЗаявки();	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПроверитьСтатусЗаявки(Объект.Заявка.СтатусЗаявки, Отказ)
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОповеститьОбИзменении(Объект.Заявка);
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)
	ОтобразитьСтатусСогласованияЗаявки();		
КонецПроцедуры


&НаКлиенте
Процедура ОдобритьЗаявку(Команда)
	
	Объект.ОтветственныйЗаЗаявку = ПолучитьОтветственногоЗаЗаявку(Объект.Заявка);
	
	Объект.Согласована = Истина;
	Объект.Отклонена = Ложь;
	Элементы.ПричинаОтклонения.Видимость = Ложь;
	Элементы.ПодробноеОписаниеПричины.Видимость = Ложь;
	
	ОтобразитьСтатусСогласованияЗаявки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьЗаявку(Команда)
	
	Объект.ОтветственныйЗаЗаявку = ПолучитьОтветственногоЗаЗаявку(Объект.Заявка);
	
	Объект.Согласована = Ложь;
	Объект.Отклонена = Истина;
	Элементы.ПричинаОтклонения.Видимость = Истина;
	Элементы.ПодробноеОписаниеПричины.Видимость = Истина;
	
	ОтобразитьСтатусСогласованияЗаявки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьРешение(Команда)
	
	Объект.ОтветственныйЗаЗаявку = ПолучитьОтветственногоЗаЗаявку(Объект.Заявка);
	
	Объект.Согласована = Ложь;
	Объект.Отклонена = Ложь;
	Элементы.ПричинаОтклонения.Видимость = Ложь;
	Элементы.ПодробноеОписаниеПричины.Видимость = Ложь;
	
	ОтобразитьСтатусСогласованияЗаявки();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОтветственногоЗаЗаявку(ЗаявкаНаПодбор)

	ОтветственныйЗаЗаявку = ПараметрыСеанса.ТекущийПользователь.Сотрудник;
	
	УстановитьОтветственногоВЗаявке(ЗаявкаНаПодбор, ОтветственныйЗаЗаявку);
	
	Возврат ОтветственныйЗаЗаявку;

КонецФункции 

&НаСервереБезКонтекста
Процедура УстановитьОтветственногоВЗаявке(ЗаявкаНаПодбор, ОтветственныйЗаЗаявку)

	ЗаявкаОбъект = ЗаявкаНаПодбор.ПолучитьОбъект();	
	ЗаявкаОбъект.ОтветственныйЗаЗаявку = ОтветственныйЗаЗаявку;
	ЗаявкаОбъект.Записать();

КонецПроцедуры

&НаСервере
Процедура ПроверитьСтатусЗаявки(СтатусЗаявки, Отказ)
	
	Если НЕ СтатусЗаявки.Пустая() И СтатусЗаявки <> Перечисления.СтатусыЗаявокНаПодбор.Черновик Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Уже был создан документ ""Согласование заявки"" на основе этой заявки";
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьПричинуОтклонения()

	Если Объект.Отклонена Тогда
		Элементы.ПричинаОтклонения.Видимость = Истина;
		Элементы.ПодробноеОписаниеПричины.Видимость = Истина;
	Иначе
		Элементы.ПричинаОтклонения.Видимость = Ложь;
		Элементы.ПодробноеОписаниеПричины.Видимость = Ложь;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьСтатусСогласованияЗаявки()
	
	Если Объект.Заявка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСтатусСогласования.Видимость = Истина;
	
	Если НЕ Объект.Отклонена И НЕ Объект.Согласована Тогда
		Элементы.ГруппаСтатусСогласования.ЦветФона = Новый Цвет(255, 250, 217); 
		Элементы.ДекорацияКартинкаСтатуса.Картинка = БиблиотекаКартинок.ОформлениеЗнакВосклицательныйЗнак;
		Элементы.ДекорацияСтатусСогласования.Заголовок = "Заявка находится на согласовании";
	ИначеЕсли Объект.Согласована Тогда
		Элементы.ГруппаСтатусСогласования.ЦветФона = Новый Цвет(204, 255, 204); 
		Элементы.ДекорацияКартинкаСтатуса.Картинка = БиблиотекаКартинок.ОформлениеЗнакФлажок;
		Элементы.ДекорацияСтатусСогласования.Заголовок = "Заявка одобрена";
	ИначеЕсли Объект.Отклонена Тогда
		Элементы.ГруппаСтатусСогласования.ЦветФона = Новый Цвет(255, 192, 203); 
		Элементы.ДекорацияКартинкаСтатуса.Картинка = БиблиотекаКартинок.ОформлениеЗнакКрест;
		Элементы.ДекорацияСтатусСогласования.Заголовок = "Заявка отклонена";	
	КонецЕсли;

КонецПроцедуры
